## PAIR PROGRAMMING LIMPIEZA III

### Valores Nulos Sklearn
---

En este caso trabajaremos con el dataframe que limpiamos en el ejercicio de pair de **Limpieza III** donde limpiabamos las columnas de species, age, etc. y eliminabamos los outliers. Hoy volveremos a gestionar valores nulos, pero en este caso usaremos los m√©todos de imputaci√≥n de sklearn.

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro an√°lisis.

- ¬øEs Australia es el sitio m√°s peligroso y letal para estar relajada en la playa?
- ¬øCu√°l es el rango de edad que sufre la mayor√≠a de los ataques?
- Independientemente de la edad, sufren los hombres m√°s ataques que las mujeres?
- ¬øEn qu√© mes ocurren m√°s ataques?
- ¬øCu√°l es la relaci√≥n entre la especie y el tipo de ataque (si es fatal o no)?
- ¬øC√≥mo han evolucionado los ataques a lo largo del tiempo?

Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I y II ya dejamos algunas columnas limpitas:


- age ‚úîÔ∏è la limpiamos en el pair de Limpieza II
- species ‚úîÔ∏è la limpiamos en el pair de Limpieza II
- country ‚úîÔ∏è la limpiamos en el pair de Limpieza II
- fatal ‚úîÔ∏è la limpiamos en el pair de Pandas V
- year ‚úîÔ∏è es una columna de tipo float deber√≠amos convertirla a integer
- sex ‚úîÔ∏è la limpiamos en el pair de Pandas V
- fecha ‚úîÔ∏è la limpiamos en el pair de Pandas V

Es el momento de ponernos a trabajar con los valores nulos de nuevo üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos de skelarn intentemos aplicarlos todos. Manos a la obra!

---

In [94]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

In [95]:
df = pd.read_pickle("../files/attacks10.pickle")
df.head()

,case_number,year,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,edades,mes
0,1800.00.00,1997,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,NaN
1,1797.05.28.R,1997,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,NaN,NaN,NaN,May
2,1792.09.12,1997,Provoked,england,Fishing,NaN,NaN,12-Sep-1792,Sep,Y,M,NaN,NaN,Sep
3,1791.00.00,1997,Unprovoked,australia,NaN,NaN,NaN,1791,NaN,Y,F,NaN,NaN,NaN
4,1788.05.10,1997,Boat,australia,Fishing,NaN,NaN,10-May-1788,May,N,NaN,NaN,NaN,May

**EJERCICIO 1**

Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de la columna age por la media de la edad usando el m√©todo SimpleImputer.

In [96]:
df['edades'].isnull().sum()

162

In [97]:
imputer= SimpleImputer(strategy="mean",missing_values=np.nan)

In [98]:
imputer= imputer.fit(df[['edades']])

In [99]:
df['edades'] = imputer.transform(df[['edades']])

In [100]:
df['edades'].isnull().sum()

0

---

- Reemplazad los valores nulos de la columna sex por la moda, usando el m√©todo SimpleImputer.
    üí° Pista üí° La moda en este tipo de aproximaci√≥n se indica como most_frequent.

In [101]:
df['sexo'].isnull().sum()

14

In [102]:
imputer= SimpleImputer(strategy="most_frequent",missing_values=np.nan)

In [103]:
imputer= imputer.fit(df[['sexo']])

In [104]:
df['sexo'] = imputer.transform(df[['sexo']])

In [105]:
df['sexo'].isnull().sum()

0

---

- Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda) con el m√©todo SimpleImputer.

In [106]:
df['type'].isnull().sum() #comprobamos los valores nulos y vemos que no hay ninguno, a√∫n as√≠ escribimos el c√≥digo

0

---

- Utilizad el m√©todo KNN Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [107]:
numericas= df.select_dtypes(include=np.number)
numericas.head()

   year     edades
0  1997  27.878808
1  1997  27.878808
2  1997  27.878808
3  1997  27.878808
4  1997  27.878808

In [108]:
imputerKNN = KNNImputer(n_neighbors=5)
imputerKNN.fit(numericas)

KNNImputer()

In [109]:
numericas_knn= imputerKNN.transform(numericas)

In [110]:
df_knn_imputer = pd.DataFrame(numericas_knn, columns = numericas.columns)

In [111]:
columnas_knn = df_knn_imputer.columns

In [112]:
df.drop(columnas_knn, axis = 1, inplace = True)

In [113]:
df[columnas_knn] = numericas_knn

In [114]:
df.head(2)

,case_number,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,mes,year,edades
0,1800.00.00,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,1997.0,27.878808
1,1797.05.28.R,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,M,NaN,May,1997.0,27.878808

---

- Utilizad el m√©todo Iterative Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [115]:
df_2 = pd.read_pickle("../files/attacks10.pickle")
df_2.head()

,case_number,year,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,edades,mes
0,1800.00.00,1997,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,NaN
1,1797.05.28.R,1997,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,NaN,NaN,NaN,May
2,1792.09.12,1997,Provoked,england,Fishing,NaN,NaN,12-Sep-1792,Sep,Y,M,NaN,NaN,Sep
3,1791.00.00,1997,Unprovoked,australia,NaN,NaN,NaN,1791,NaN,Y,F,NaN,NaN,NaN
4,1788.05.10,1997,Boat,australia,Fishing,NaN,NaN,10-May-1788,May,N,NaN,NaN,NaN,May

In [116]:
numericas= df_2.select_dtypes(include=np.number)
numericas.head()

   year  edades
0  1997     NaN
1  1997     NaN
2  1997     NaN
3  1997     NaN
4  1997     NaN

In [117]:
print(df_2['edades'].mean())
print(df_2['edades'].median())

27.87880794701987
25.0

In [118]:
numericas.isnull().sum()

year        0
edades    162
dtype: int64

In [119]:
imputer = IterativeImputer(max_iter=20, n_nearest_features=None, imputation_order='ascending', initial_strategy= 'median')

In [120]:
imputer = imputer.fit(numericas)

In [121]:
imputer.transform(numericas)

array([[1997.        ,   28.42154923],
       [1997.        ,   28.42154923],
       [1997.        ,   28.42154923],
       ...,
       [1997.        ,   21.        ],
       [1997.        ,   12.        ],
       [1997.        ,   35.        ]])

In [122]:
# df_2['edades_mean']= imputer.transform(df_2['edades']) #revisar

In [123]:
numericas_trans = pd.DataFrame(imputer.transform(numericas), columns = numericas.columns)

In [124]:
columnas = numericas_trans.columns

In [125]:
df_2.drop(columnas, axis = 1, inplace = True)

In [126]:
df_2[columnas] = numericas_trans[columnas]

In [127]:
df_2.isnull().sum()

case_number      0
type             0
country         10
activity        31
age            154
species_       126
date             0
mes_ataque     141
fatal           97
sexo            14
cat_species    126
mes            170
year             0
edades           0
dtype: int64

In [128]:
df_2.head()

,case_number,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,mes,year,edades
0,1800.00.00,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,1997.0,28.421549
1,1797.05.28.R,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,NaN,NaN,May,1997.0,28.421549
2,1792.09.12,Provoked,england,Fishing,NaN,NaN,12-Sep-1792,Sep,Y,M,NaN,Sep,1997.0,28.421549
3,1791.00.00,Unprovoked,australia,NaN,NaN,NaN,1791,NaN,Y,F,NaN,NaN,1997.0,28.421549
4,1788.05.10,Boat,australia,Fishing,NaN,NaN,10-May-1788,May,N,NaN,NaN,May,1997.0,28.421549

---

- ¬øPodr√≠ais explicar qu√© diferencia hay entre estos dos √∫ltimos m√©todos?

    - Con el m√©todo de KNN Imputer no podemos asignarle par√°metros para controlar el orden de comparaci√≥n con las columnas, ni redondear decimales, ni especificar con que estad√≠stico queremos reemplazar, cosa que con el m√©todo Iterative Imputer si podemos hacer.

---

EJERCICIO 2

Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [130]:
df.to_pickle('../files/attacks12.pickle')